InformationRegisters/ИсполнительныеПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ИсполнительныеПроизводства</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПроверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатПроверки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ФССПСлужебный/Ext/Module.bsl
//&НаСервере
//Процедура ПолучитьИП(Должник, ДатаРождения, Код) Экспорт
//	Если ЗначениеЗаполнено(ОбъектыСервер.ПолучитьЗначениеСвойства(Должник, "0188")) Тогда
//		КодРегиона = ОбъектыСервер.ПолучитьЗначениеСвойства(Должник, "0188");
//	Иначе
//		Попытка
//			// Получить код региона	
//			КодРегиона = ДаДатаСлужебный.ПолучитьКодРегиона(ОбъектыСервер.ПолучитьЗначениеСвойства(Должник, "0049"));
//			ОбъектыСервер.ЗаписатьЗначениеСвойства(Должник, "0188", КодРегиона);
//		Исключение 
//			// Адрес непригоден
//			Сообщить("Не удалось определить регион должника! Проверьте наличие и корректность адреса регистрации");
//			Возврат;
//		КонецПопытки;
//	КонецЕсли;
//	
//	Попытка
//		// Запрос к API
//		SSL = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Новый СертификатыУдостоверяющихЦентровОС());  
//		Соединение = Новый HTTPСоединение("api.xn--80ajbekothchmme5j.xn--p1ai", 443,,,,, SSL);
//		
//		Заголовки = Новый Соответствие;
//		Заголовки.Вставить("Authorization", "Bearer " + "x7eR9QcM7qWJzmIzZ_LS5yr_dwlK01Ik");
//		Заголовки.Вставить("Content-Type", "application/json");
//		
//		Данные = Новый Структура();
//		Данные.Вставить("document_type", "fio_birth_date_requisite");
//		ИП = Новый Структура();
//		ИП.Вставить("birth_date", ДатаРождения);
//		ИП.Вставить("fio", Строка(Должник));
//		ИП.Вставить("region_id", КодРегиона);
//		Данные.Вставить("document_value", ИП);
//		
//		ЗаписьJSON = Новый ЗаписьJSON;            
//		ЗаписьJSON.УстановитьСтроку();
//		ЗаписатьJSON(ЗаписьJSON, Данные);            
//		ТелоЗапроса = ЗаписьJSON.Закрыть(); 
//		
//		Запрос = Новый HTTPЗапрос("/fssp/frontend-search?yandexToken=dD0xNzQxNjg2MjQ4O2k9OTMuOTIuMTk0Ljg2O0Q9MjhCRTlCNDM1MEZBNTVFOTJDMjRCQTQxNjUxMUE3QTA0ODkzMkUyN0M3QUVFNTA3NEMzOEUyNzQ3MjVDQjQyRkIzOEM2MTFDRUFBMzJGQzE1NkQxNzRGRTBFMjUyNEJENUI1NzE4ODBFODE5Q0VBMUI4Qzg0RDExM0ZGN0VGRjVFMDA3NjQyMkIzNTIzNUM5MzM3QzVGQzI2NjFFNEEwMENEN0E7dT0xNzQxNjg2MjQ4MDgxMDA0NzM0O2g9ZjM5MGZmNTY2ZmI5NWZlMmZiYmZlOGMyZTg5Y2IzNmQ=&lead_source_id=search&lead_source_id_ext=all_docs_additional_offer", Заголовки);
//		Запрос.УстановитьТелоИзСтроки(ТелоЗапроса);
//		
//		Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
//		
//		Если Ответ.КодСостояния = 500 ИЛИ Ответ.КодСостояния = 429 Тогда
//			МенеджерЗаписи = РегистрыСведений.ИсполнительныеПроизводства.СоздатьМенеджерЗаписи();
//			
//			МенеджерЗаписи.Должник = Справочники.Контрагенты.НайтиПоКоду(Код);
//			УИДЗапроса = Новый УникальныйИдентификатор();
//			МенеджерЗаписи.Должник = "База данных ФССП России не отвечает " + "(" + УИДЗапроса + ")";
//			МенеджерЗаписи.ДатаПроверки = ТекущаяДата();
//			
//			МенеджерЗаписи.Записать();
//		КонецЕсли;		
//		
//		//Сообщить(Ответ.ПолучитьТелоКакСтроку());
//		
//		ЧтениеJSON = Новый ЧтениеJSON;
//		ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
//		Данные = ПрочитатьJSON(ЧтениеJSON, Ложь);
//		ЧтениеJSON.Закрыть();	
//		
//		// Парсинг JSON
//		Попытка
//			Если Данные[0].accruals = Неопределено Или Данные[0].accrual_count = 0 Тогда
//				МенеджерЗаписи = РегистрыСведений.ИсполнительныеПроизводства.СоздатьМенеджерЗаписи();
//				
//				МенеджерЗаписи.Должник = Справочники.Контрагенты.НайтиПоКоду(Код);
//				УИДЗапроса = Новый УникальныйИдентификатор();
//				МенеджерЗаписи.Должник = "Действующие ИП не найдены " + "(" + УИДЗапроса + ")";
//				МенеджерЗаписи.ДатаПроверки = СтрСоединить(СтрРазделить(Данные[0].check_date, "- :"), "");
//				
//				МенеджерЗаписи.Записать();
//				
//			ИначеЕсли Данные[0].accruals.Количество() > 0 Тогда
//				УдалитьСтарыеИП(Код);
//				// Записать признак наличия ИП
//				ДолжникОбъект = Справочники.Контрагенты.НайтиПоКоду(Код).ПолучитьОбъект();
//				Если Не ДолжникОбъект.ЕстьИП Тогда
//					ДолжникОбъект.ЕстьИП = Истина;
//					ДолжникОбъект.Записать();
//				КонецЕсли;
//				Для Сч = 0 По Данные[0].accruals.ВГраница() Цикл
//					ИП = Данные[0].accruals[Сч].account;
//					ОСП = Данные[0].accruals[Сч].additional_fields.division_name;
//					ИД = Данные[0].accruals[Сч].additional_fields.exe_doc_reqs;
//					РеквизитыИД = СтрокуВЧисло(Данные[0].accruals[Сч].additional_fields.exe_doc_reqs);
//					Для Каждого Стр Из РеквизитыИД Цикл
//						Если СтрДлина(Стр) = 10 Тогда
//							ИННВзыскателя = Стр;
//							// Нормализовать взыскателя							
//							Попытка
//								Взыскатель = ДаДатаСлужебный.ПолучитьВзыскателя(Стр);
//							Исключение
//								Взыскатель = "—";
//							КонецПопытки;
//						Иначе
//							Взыскатель = "—";
//						КонецЕсли;
//					КонецЦикла;
//					ДанныеСПИ = Данные[0].accruals[Сч].additional_fields.officer;
//					// Разложить на массив
//					МассивДанныхСПИ = СтрРазделить(СтрЗаменить(ДанныеСПИ, ".+", ". +"), " ", Ложь);
//					СПИ = МассивДанныхСПИ[0] + " " + МассивДанныхСПИ[1]  + " " + МассивДанныхСПИ[2];
//					Если МассивДанныхСПИ.Количество() > 3 Тогда 
//						ТелефонСПИ = МассивДанныхСПИ[3];
//					КонецЕсли;
//					ДатаПроверки = СтрСоединить(СтрРазделить(Данные[0].accruals[Сч].check_time, "- :"), "");
//					ДатаВозбуждения = СтрСоединить(СтрРазделить(Данные[0].accruals[Сч].date, "- :"), "");
//					// Привести суммы к дробному числу
//					МассивСуммИП = ДостатьЧислаИзСтроки(Данные[0].accruals[Сч].description);
//					Если МассивСуммИП.Количество() > 1 Тогда
//						СуммаИП = МассивСуммИП[0];
//						СуммаИспСбора = МассивСуммИП[1];
//					Иначе
//						СуммаИП = МассивСуммИП[0];
//					КонецЕсли;
//					ТипИД = Данные[0].accruals[Сч].description;
//					СтатусИД = Данные[0].accruals[Сч].status.name;
//					
//					// Записать ИП в регистр сведений
//					МенеджерЗаписи = РегистрыСведений.ИсполнительныеПроизводства.СоздатьМенеджерЗаписи();
//					
//					МенеджерЗаписи.Должник = Справочники.Контрагенты.НайтиПоКоду(Код);
//					//МенеджерЗаписи.ИП = ИП + "-ИП";
//					МенеджерЗаписи.Должник = ИП;
//					МенеджерЗаписи.ОСП = ОСП;
//					МенеджерЗаписи.ИД = ИД;
//					МенеджерЗаписи.Взыскатель = Взыскатель;
//					МенеджерЗаписи.СПИ = СПИ; 
//					МенеджерЗаписи.ТелефонСПИ = ТелефонСПИ;
//					МенеджерЗаписи.ДатаПроверки = ДатаПроверки;
//					МенеджерЗаписи.ДатаВозбуждения = ДатаВозбуждения;
//					МенеджерЗаписи.СуммаЗадолженности = СуммаИП;
//					МенеджерЗаписи.СуммаИсполнительскогоСбора = СуммаИспСбора;
//					МенеджерЗаписи.Всего = СуммаИП + ?(ЗначениеЗаполнено(СуммаИспСбора), СуммаИспСбора, 0);
//					МенеджерЗаписи.ТипИД = ТипИД;
//					МенеджерЗаписи.СтатусИД = СтатусИД;
//					
//					МенеджерЗаписи.Записать();
//				КонецЦикла;
//			КонецЕсли;
//		Исключение
//		КонецПопытки;
//	Исключение
//		МенеджерЗаписи = РегистрыСведений.ИсполнительныеПроизводства.СоздатьМенеджерЗаписи();
//		
//		МенеджерЗаписи.Должник = Справочники.Контрагенты.НайтиПоКоду(Код);
//		УИДЗапроса = Новый УникальныйИдентификатор();
//		МенеджерЗаписи.Должник = "База данных ФССП России не отвечает " + "(" + УИДЗапроса + ")";
//		МенеджерЗаписи.ДатаПроверки = ТекущаяДата();
//		
//		МенеджерЗаписи.Записать();
//	КонецПопытки;
//КонецПроцедуры

&НаСервере
Функция ДостатьЧислаИзСтроки(ИсходнаяСтрока, Разделители =  ".,") Экспорт
	Масс = Новый Массив;
	RegExp = Новый COMОбъект("VBScript.RegExp"); 
	RegExp.IgnoreCase = Истина; 
	RegExp.Global = Истина; 
	RegExp.MultiLine = Ложь; 
	RegExp.Pattern = "-*\d+[" + разделители + "]\d*";
	Matches= RegExp.Execute(ИсходнаяСтрока); 
	Для Сч = 0 по Matches.Count() - 1 Цикл
		Match = Matches.Item(Сч);
		Попытка
			Масс.Добавить(Число(Match.Value));
		Исключение
		КонецПопытки;
		Submatches = Match.Submatches;
		Для Сч1 = 0 по Submatches.Count() - 1 Цикл
			Submatch = Submatches.Item(Сч1);
			Попытка
				Масс.Добавить(Число(Submatch.Value));
			Исключение
			КонецПопытки;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Масс;
КонецФункции

&НаСервере
Функция СтрокуВЧисло(СтрокаСЧислом) Экспорт
	МассивСтрок = СтрРазделить(СтрокаСЧислом, "0123456789", Ложь);
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Текст");
	ТЗ.Колонки.Добавить("Длина", Новый ОписаниеТипов("Число"));
	Для Каждого ТекСтрока из МассивСтрок Цикл 
		Приемник = ТЗ.Добавить();
		Приемник.Текст = ТекСтрока;
		Приемник.Длина = СтрДлина(ТекСтрока);
	КонецЦикла;  
	
	ТЗ.Сортировать("Длина УБЫВ");    
	
	Для Каждого Запись из ТЗ Цикл 
		ТекСтрока = Запись.Текст;
		СтрокаСЧислом = СтрЗаменить(СтрокаСЧислом, ТекСтрока, Символы.ПС);
	КонецЦикла;
	
	МассивЧисел = СтрРазделить(СтрокаСЧислом, Символы.ПС, Ложь);
	
	Возврат МассивЧисел;
КонецФункции

Функция УдалитьСтарыеИП(Должник) Экспорт
	// Удалить старые ИП по должнику
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИсполнительныеПроизводства.Должник КАК Должник,
	|	ИсполнительныеПроизводства.ДатаПроверки КАК ДатаВозбуждения,
	|	ИсполнительныеПроизводства.РезультатПроверки КАК РезультатПроверки
	|ИЗ
	|	РегистрСведений.ИсполнительныеПроизводства КАК ИсполнительныеПроизводства
	|ГДЕ
	|	ИсполнительныеПроизводства.Должник = &Должник";
	Запрос.УстановитьПараметр("Должник", Должник);	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.ИсполнительныеПроизводства.СоздатьМенеджерЗаписи();		
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);		
		МенеджерЗаписи.Удалить();        
	КонецЦикла;
КонецФункции

Функция ПолучитьКодРегионаПоДолжнику(Должник) Экспорт
	Если ЗначениеЗаполнено(ОбъектыСервер.ПолучитьЗначениеСвойства(Должник, "0188")) Тогда
		КодРегиона = ОбъектыСервер.ПолучитьЗначениеСвойства(Должник, "0188");
		Возврат КодРегиона;
	Иначе
		Попытка
			// Получить код региона	
			КодРегиона = ДаДатаСлужебный.ПолучитьКодРегиона(ОбъектыСервер.ПолучитьЗначениеСвойства(Должник, "0049"));
			ОбъектыСервер.ЗаписатьЗначениеСвойства(Должник, "0188", КодРегиона);
			Возврат ОбъектыСервер.ПолучитьЗначениеСвойства(Должник, "0188");
		Исключение 
			// Адрес непригоден
			Возврат Неопределено;
		КонецПопытки;
	КонецЕсли;
КонецФункции
